TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_SEC_ENABLE_CLR Bits */
/* MCAN_SEC_ENABLE_CLR[MSGMEM_ENABLE_CLR] Bits */
#define MCAN_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR_OFS (0)                             /* !< MSGMEM_ENABLE_CLR Offset */
#define MCAN_SEC_ENABLE_CLR_MSGMEM_ENABLE_CLR_MASK ((uint32_t)0x00000001U)         /* !< Message RAM SEC Interrupt Pending
                                                                                    Enable Clear. Writing a 1 to this bit
                                                                                    disables the Message RAM SEC error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* MCAN_DED_EOI Bits */
/* MCAN_DED_EOI[EOI_WR] Bits */
#define MCAN_DED_EOI_EOI_WR_OFS                  (0)                             /* !< EOI_WR Offset */
#define MCAN_DED_EOI_EOI_WR_MASK                 ((uint32_t)0x00000001U)         /* !< Write to this register indicates
                                                                                    that software has acknowledged the
                                                                                    pending interrupt and the next
                                                                                    interrupt can be sent to the host.
                                                                                    Note that a write to the
                                                                                    MCANERR_ERR_STAT1.CLR_ECC_DED goes
                                                                                    through the SVBUS and has a delayed
                                                                                    completion. To avoid an additional
                                                                                    interrupt, read the MCANERR_ERR_STAT1
                                                                                    register back prior to writing to
                                                                                    this bit field. */

/* MCAN_DED_STATUS Bits */
/* MCAN_DED_STATUS[MSGMEM_PEND] Bits */
#define MCAN_DED_STATUS_MSGMEM_PEND_OFS          (0)                             /* !< MSGMEM_PEND Offset */
#define MCAN_DED_STATUS_MSGMEM_PEND_MASK         ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    0  No DED interrupt is pending   1
                                                                                    DED interrupt is pending */

/* MCAN_DED_ENABLE_SET Bits */
/* MCAN_DED_ENABLE_SET[MSGMEM_ENABLE_SET] Bits */
#define MCAN_DED_ENABLE_SET_MSGMEM_ENABLE_SET_OFS (0)                             /* !< MSGMEM_ENABLE_SET Offset */
#define MCAN_DED_ENABLE_SET_MSGMEM_ENABLE_SET_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    Enable Set. Writing a 1 to this bit
                                                                                    enables the Message RAM DED error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* MCAN_DED_ENABLE_CLR Bits */
/* MCAN_DED_ENABLE_CLR[MSGMEM_ENABLE_CLR] Bits */
#define MCAN_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR_OFS (0)                             /* !< MSGMEM_ENABLE_CLR Offset */
#define MCAN_DED_ENABLE_CLR_MSGMEM_ENABLE_CLR_MASK ((uint32_t)0x00000001U)         /* !< Message RAM DED Interrupt Pending
                                                                                    Enable Clear. Writing a 1 to this bit
                                                                                    disables the Message RAM DED error
                                                                                    interrupts. Writing a 0 has no
                                                                                    effect. Reads return the
                                                                                    corresponding enable bit's current
                                                                                    value. */

/* MCAN_AGGR_ENABLE_SET Bits */
/* MCAN_AGGR_ENABLE_SET[ENABLE_PARITY_SET] Bits */
#define MCAN_AGGR_ENABLE_SET_ENABLE_PARITY_SET_OFS (0)                             /* !< ENABLE_PARITY_SET Offset */
#define MCAN_AGGR_ENABLE_SET_ENABLE_PARITY_SET_MASK ((uint32_t)0x00000001U)         /* !< Write 1 to enable parity errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */
/* MCAN_AGGR_ENABLE_SET[ENABLE_TIMEOUT_SET] Bits */
#define MCAN_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET_OFS (1)                             /* !< ENABLE_TIMEOUT_SET Offset */
#define MCAN_AGGR_ENABLE_SET_ENABLE_TIMEOUT_SET_MASK ((uint32_t)0x00000002U)         /* !< Write 1 to enable timeout errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */

