TexasInstruments/mspm0-sdk/source/third_party/tinyusb/hw/mcu/ti/mspm0/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_IE Bits */
/* MCAN_IE[RF0NE] Bits */
#define MCAN_IE_RF0NE_OFS                        (0)                             /* !< RF0NE Offset */
#define MCAN_IE_RF0NE_MASK                       ((uint32_t)0x00000001U)         /* !< Rx FIFO 0 New Message Enable */
/* MCAN_IE[RF0WE] Bits */
#define MCAN_IE_RF0WE_OFS                        (1)                             /* !< RF0WE Offset */
#define MCAN_IE_RF0WE_MASK                       ((uint32_t)0x00000002U)         /* !< Rx FIFO 0 Watermark Reached Enable */
/* MCAN_IE[RF0FE] Bits */
#define MCAN_IE_RF0FE_OFS                        (2)                             /* !< RF0FE Offset */
#define MCAN_IE_RF0FE_MASK                       ((uint32_t)0x00000004U)         /* !< Rx FIFO 0 Full Enable */
/* MCAN_IE[RF0LE] Bits */
#define MCAN_IE_RF0LE_OFS                        (3)                             /* !< RF0LE Offset */
#define MCAN_IE_RF0LE_MASK                       ((uint32_t)0x00000008U)         /* !< Rx FIFO 0 Message Lost Enable */
/* MCAN_IE[RF1NE] Bits */
#define MCAN_IE_RF1NE_OFS                        (4)                             /* !< RF1NE Offset */
#define MCAN_IE_RF1NE_MASK                       ((uint32_t)0x00000010U)         /* !< Rx FIFO 1 New Message Enable */
/* MCAN_IE[RF1WE] Bits */
#define MCAN_IE_RF1WE_OFS                        (5)                             /* !< RF1WE Offset */
#define MCAN_IE_RF1WE_MASK                       ((uint32_t)0x00000020U)         /* !< Rx FIFO 1 Watermark Reached Enable */
/* MCAN_IE[RF1FE] Bits */
#define MCAN_IE_RF1FE_OFS                        (6)                             /* !< RF1FE Offset */
#define MCAN_IE_RF1FE_MASK                       ((uint32_t)0x00000040U)         /* !< Rx FIFO 1 Full Enable */
/* MCAN_IE[RF1LE] Bits */
#define MCAN_IE_RF1LE_OFS                        (7)                             /* !< RF1LE Offset */
#define MCAN_IE_RF1LE_MASK                       ((uint32_t)0x00000080U)         /* !< Rx FIFO 1 Message Lost Enable */
/* MCAN_IE[HPME] Bits */
#define MCAN_IE_HPME_OFS                         (8)                             /* !< HPME Offset */
#define MCAN_IE_HPME_MASK                        ((uint32_t)0x00000100U)         /* !< High Priority Message Enable */
/* MCAN_IE[TCE] Bits */
#define MCAN_IE_TCE_OFS                          (9)                             /* !< TCE Offset */
#define MCAN_IE_TCE_MASK                         ((uint32_t)0x00000200U)         /* !< Transmission Completed Enable */
/* MCAN_IE[TCFE] Bits */
#define MCAN_IE_TCFE_OFS                         (10)                            /* !< TCFE Offset */
#define MCAN_IE_TCFE_MASK                        ((uint32_t)0x00000400U)         /* !< Transmission Cancellation Finished
                                                                                    Enable */
/* MCAN_IE[TFEE] Bits */
#define MCAN_IE_TFEE_OFS                         (11)                            /* !< TFEE Offset */
#define MCAN_IE_TFEE_MASK                        ((uint32_t)0x00000800U)         /* !< Tx FIFO Empty Enable */
/* MCAN_IE[TEFNE] Bits */
#define MCAN_IE_TEFNE_OFS                        (12)                            /* !< TEFNE Offset */
#define MCAN_IE_TEFNE_MASK                       ((uint32_t)0x00001000U)         /* !< Tx Event FIFO New Entry Enable */
/* MCAN_IE[TEFWE] Bits */
#define MCAN_IE_TEFWE_OFS                        (13)                            /* !< TEFWE Offset */
#define MCAN_IE_TEFWE_MASK                       ((uint32_t)0x00002000U)         /* !< Tx Event FIFO Watermark Reached
                                                                                    Enable */
/* MCAN_IE[TEFFE] Bits */
#define MCAN_IE_TEFFE_OFS                        (14)                            /* !< TEFFE Offset */
#define MCAN_IE_TEFFE_MASK                       ((uint32_t)0x00004000U)         /* !< Tx Event FIFO Full Enable */
/* MCAN_IE[TEFLE] Bits */
#define MCAN_IE_TEFLE_OFS                        (15)                            /* !< TEFLE Offset */
#define MCAN_IE_TEFLE_MASK                       ((uint32_t)0x00008000U)         /* !< Tx Event FIFO Element Lost Enable */
/* MCAN_IE[TSWE] Bits */
#define MCAN_IE_TSWE_OFS                         (16)                            /* !< TSWE Offset */
#define MCAN_IE_TSWE_MASK                        ((uint32_t)0x00010000U)         /* !< Timestamp Wraparound Enable */
/* MCAN_IE[MRAFE] Bits */
#define MCAN_IE_MRAFE_OFS                        (17)                            /* !< MRAFE Offset */
#define MCAN_IE_MRAFE_MASK                       ((uint32_t)0x00020000U)         /* !< Message RAM Access Failure Enable */
/* MCAN_IE[TOOE] Bits */
#define MCAN_IE_TOOE_OFS                         (18)                            /* !< TOOE Offset */
#define MCAN_IE_TOOE_MASK                        ((uint32_t)0x00040000U)         /* !< Timeout Occurred Enable */
/* MCAN_IE[DRXE] Bits */
#define MCAN_IE_DRXE_OFS                         (19)                            /* !< DRXE Offset */
#define MCAN_IE_DRXE_MASK                        ((uint32_t)0x00080000U)         /* !< Message Stored to Dedicated Rx
                                                                                    Buffer Enable */
/* MCAN_IE[BECE] Bits */
#define MCAN_IE_BECE_OFS                         (20)                            /* !< BECE Offset */
#define MCAN_IE_BECE_MASK                        ((uint32_t)0x00100000U)         /* !< Bit Error Corrected Enable   A
                                                                                    separate interrupt line reserved for
                                                                                    corrected bit errors is provided via
                                                                                    the MCAN_ERROR_REGS. It advised for
                                                                                    the user to use these registers and
                                                                                    leave this bit cleared to '0'. */
/* MCAN_IE[BEUE] Bits */
#define MCAN_IE_BEUE_OFS                         (21)                            /* !< BEUE Offset */
#define MCAN_IE_BEUE_MASK                        ((uint32_t)0x00200000U)         /* !< Bit Error Uncorrected Enable */
/* MCAN_IE[ELOE] Bits */
#define MCAN_IE_ELOE_OFS                         (22)                            /* !< ELOE Offset */
#define MCAN_IE_ELOE_MASK                        ((uint32_t)0x00400000U)         /* !< Error Logging Overflow Enable */
/* MCAN_IE[EPE] Bits */
#define MCAN_IE_EPE_OFS                          (23)                            /* !< EPE Offset */
#define MCAN_IE_EPE_MASK                         ((uint32_t)0x00800000U)         /* !< Error Passive Enable */
/* MCAN_IE[EWE] Bits */
#define MCAN_IE_EWE_OFS                          (24)                            /* !< EWE Offset */
#define MCAN_IE_EWE_MASK                         ((uint32_t)0x01000000U)         /* !< Warning Status Enable */
/* MCAN_IE[BOE] Bits */
#define MCAN_IE_BOE_OFS                          (25)                            /* !< BOE Offset */
#define MCAN_IE_BOE_MASK                         ((uint32_t)0x02000000U)         /* !< Bus_Off Status Enable */
/* MCAN_IE[WDIE] Bits */
#define MCAN_IE_WDIE_OFS                         (26)                            /* !< WDIE Offset */
#define MCAN_IE_WDIE_MASK                        ((uint32_t)0x04000000U)         /* !< Watchdog Interrupt Enable */
/* MCAN_IE[PEAE] Bits */
#define MCAN_IE_PEAE_OFS                         (27)                            /* !< PEAE Offset */
#define MCAN_IE_PEAE_MASK                        ((uint32_t)0x08000000U)         /* !< Protocol Error in Arbitration Phase
                                                                                    Enable */
/* MCAN_IE[PEDE] Bits */
#define MCAN_IE_PEDE_OFS                         (28)                            /* !< PEDE Offset */
#define MCAN_IE_PEDE_MASK                        ((uint32_t)0x10000000U)         /* !< Protocol Error in Data Phase Enable */
/* MCAN_IE[ARAE] Bits */
#define MCAN_IE_ARAE_OFS                         (29)                            /* !< ARAE Offset */
#define MCAN_IE_ARAE_MASK                        ((uint32_t)0x20000000U)         /* !< Access to Reserved Address Enable */

